app/controllers/comments_controller.rb

INSERT INTO "comments" ("name", "email", "body", "post_id", "created_at", "updated_at") VALUES('asdfjdsalkjf;sdajf', '', 'dafdfnasdklmfnhkasdl', 1, '2010-04-29 20:13:46', '2010-04-29 20:13:46')
---
   def create
     @comment = Comment.new(params[:comment])

     if @comment.save